RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim.c
/*!
    \file    gd32h77x_78x_edim.c
    \brief   EDIM driver

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_78x_edim.h"
#include "gd32h77x_78x_edim_afmt.h"
#include "gd32h77x_78x_edim_biss.h"
#include "gd32h77x_78x_edim_endat.h"
#include "gd32h77x_78x_edim_tfmt.h"
#include "gd32h77x_78x_edim_hdsl.h"
#include <stddef.h>

typedef struct {
    uint32_t int_enable_bit;     /* interrupt enable bit/mask */
    uint32_t int_flag_bit;       /* interrupt flag bit/mask */
    uint32_t status_flag_bit;    /* raw status flag bit/mask */
} edim_dma_err_map_struct;

/* order: TIMEOUT, OVERRUN, UNDERRUN */
static const edim_dma_err_map_struct edim_dma_err_map_afmt[] = {
    { EDIM_AFMT_INT_DMATO,    EDIM_AFMT_INT_FLAG_DMATO,    EDIM_AFMT_FLAG_DMATO},
    { EDIM_AFMT_INT_FIFOOVR,  EDIM_AFMT_INT_FLAG_FIFOOVR,  EDIM_AFMT_FLAG_FIFOOVR},
    { EDIM_AFMT_INT_FIFOUNR,  EDIM_AFMT_INT_FLAG_FIFOUNR,  EDIM_AFMT_FLAG_FIFOUNR},
};
static const edim_dma_err_map_struct edim_dma_err_map_tfmt[] = {
    { EDIM_TFMT_INT_DMATO,    EDIM_TFMT_INT_FLAG_DMATO,    EDIM_TFMT_FLAG_DMATO},
    { EDIM_TFMT_INT_FIFOOVR,  EDIM_TFMT_INT_FLAG_FIFOOVR,  EDIM_TFMT_FLAG_FIFOOVR},
    { EDIM_TFMT_INT_FIFOUNR,  EDIM_TFMT_INT_FLAG_FIFOUNR,  EDIM_TFMT_FLAG_FIFOUNR},
};
static const edim_dma_err_map_struct edim_dma_err_map_endat[] = {
    { EDIM_ENDAT_INT_DMATO,   EDIM_ENDAT_INT_FLAG_DMATO,   EDIM_ENDAT_FLAG_DMATO},
    { EDIM_ENDAT_INT_FIFOOVR, EDIM_ENDAT_INT_FLAG_FIFOOVR, EDIM_ENDAT_FLAG_FIFOOVR},
    { EDIM_ENDAT_INT_FIFOUNR, EDIM_ENDAT_INT_FLAG_FIFOUNR, EDIM_ENDAT_FLAG_FIFOUNR},
};
static const edim_dma_err_map_struct edim_dma_err_map_biss[] = {
    { EDIM_BISS_INT_DMATOIE,  EDIM_BISS_INT_FLAG_DMATO,    EDIM_BISS_FLAG_DMATO},
    { EDIM_BISS_INT_FIFOOVRIE,EDIM_BISS_INT_FLAG_FIFOOVR,  EDIM_BISS_FLAG_FIFOOVR},
    { EDIM_BISS_INT_FIFOUNRIE,EDIM_BISS_INT_FLAG_FIFOUNR,  EDIM_BISS_FLAG_FIFOUNR},
};

/* poll until the specified register bit(s) become set */
static edim_error_enum edim_wait_flag_set(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_cycles);
/* validate DMA error type index */
static int edim_dma_err_index_valid(edim_dma_error_type_enum t);
/* get DMA error mapping entry pointer */
static const edim_dma_err_map_struct *edim_dma_err_map_get(edim_proto_enum edim_proto, edim_dma_error_type_enum t);

/*!
    \brief      poll until the specified register bit(s) become set
    \param[in]  reg: pointer to the volatile register address
    \param[in]  mask: bit mask of the bit(s) to check (must become set)
    \param[in]  timeout_cycles: maximum polling iterations; pass EDIM_TIMEOUT_INFINITE (0) to wait indefinitely
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
 */
static edim_error_enum edim_wait_flag_set(volatile uint32_t *reg, uint32_t mask, uint32_t timeout_cycles)
{
    edim_error_enum ret = EDIM_ERROR_NONE;
    uint32_t t = timeout_cycles;
    if (timeout_cycles == EDIM_TIMEOUT_INFINITE) {
        while(((*reg) & mask) == 0U) {
        }
    } else {
        while(((*reg) & mask) == 0U) {
            if(--t == 0U) {
                break;
            }
        }
        if (t == 0U) {
            ret = EDIM_ERROR_TIMEOUT;
        }
    }
    return ret;
}

/*!
    \brief      deinit all EDIM protocol submodules (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_deinit(void)
{
    edim_hdsl_deinit();
    edim_biss_deinit();
    edim_endat_deinit();
    edim_afmt_deinit();
    edim_tfmt_deinit();
}

/*!
    \brief      enable EDIM DMA for selected protocol (API_ID(0x0002U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: select BISS (supports 16 FIFOs)
      \arg        EDIM_PROTO_ENDAT: select ENDAT (supports 4 FIFOs)
      \arg        EDIM_PROTO_AFMT: select AFMT (supports 3 FIFOs)
      \arg        EDIM_PROTO_TFMT: select TFMT (supports 4 FIFOs)
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_dma_enable(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_BISS:
            edim_biss_dma_enable();
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_dma_enable();
            break;
        case EDIM_PROTO_AFMT:
            edim_afmt_dma_enable();
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_dma_enable();
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      disable EDIM DMA for selected protocol (API_ID(0x0003U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: select BISS
      \arg        EDIM_PROTO_ENDAT: select ENDAT
      \arg        EDIM_PROTO_AFMT: select AFMT
      \arg        EDIM_PROTO_TFMT: select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_dma_disable(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_BISS:
            edim_biss_dma_disable();
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_dma_disable();
            break;
        case EDIM_PROTO_AFMT:
            edim_afmt_dma_disable();
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_dma_disable();
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      flush EDIM DMA FIFO (API_ID(0x0004U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: select BISS
      \arg        EDIM_PROTO_ENDAT: select ENDAT
      \arg        EDIM_PROTO_AFMT: select AFMT
      \arg        EDIM_PROTO_TFMT: select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_dma_flush(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_BISS:
            edim_biss_dma_flush();
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_dma_flush();
            break;
        case EDIM_PROTO_AFMT:
            edim_afmt_dma_flush();
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_dma_flush();
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      select EDIM protocol DMA FIFO data origin (API_ID(0x0005U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: select BISS (supports 16 FIFOs)
      \arg        EDIM_PROTO_ENDAT: select ENDAT (supports 4 FIFOs)
      \arg        EDIM_PROTO_AFMT: select AFMT (supports 3 FIFOs)
      \arg        EDIM_PROTO_TFMT: select TFMT (supports 4 FIFOs)
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: channel 0
    \param[in]  fifo_selected: FIFO enable mask (protocol dependent)
                one or more parameters can be selected which is shown as below:
      \arg        EDIM_FIFOEN0 ... EDIM_FIFOEN15
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_dma_select(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_fifoen_enum fifo_selected)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        uint32_t reg_select = 0U;
        switch (edim_proto) {
        case EDIM_PROTO_BISS: {
            uint32_t maskLocal = (uint32_t)fifo_selected & 0xFFFFU;
            reg_select = (maskLocal << EDIM_DMA_BISS_DFEN_START_BIT) & EDIM_BISS_DFCTL_DMA_DFEN;
            edim_biss_dma_select(reg_select);
            break;
        }
        case EDIM_PROTO_ENDAT: {
            uint32_t maskLocal = (uint32_t)fifo_selected & 0x0FU;
            reg_select = (maskLocal << EDIM_DMA_ENDAT_DFEN_START_BIT) & EDIM_ENDAT_CFG0_DFEN_MASK;
            edim_endat_dma_select(reg_select);
            break;
        }
        case EDIM_PROTO_AFMT: {
            uint32_t maskLocal = (uint32_t)fifo_selected & 0x07U;
            reg_select = (maskLocal << EDIM_DMA_AFMT_DFEN_START_BIT) & EDIM_AFMT_CFG_DFEN_MASK;
            edim_afmt_dma_select(reg_select);
            break;
        }
        case EDIM_PROTO_TFMT: {
            uint32_t maskLocal = (uint32_t)fifo_selected & 0x0FU;
            reg_select = (maskLocal << EDIM_DMA_TFMT_DFEN_START_BIT) & EDIM_TFMT_CFG_DFEN_MASK;
            edim_tfmt_dma_select(reg_select);
            break;
        }
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      read EDIM RDATA register (API_ID(0x0006U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_HDSL: EDIM select HDSL
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] edim_buf: EDIM buffer structure
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_data_read(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_buf_struct *edim_buf)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(edim_buf)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x0006U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if ((edim_buf == NULL) || (edim_buf->sl_nums > EDIM_SLAVES_MAX)) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_HDSL: {
                uint64_t pos = edim_hdsl_position_read();
                edim_buf->rd_words[0] = (uint32_t)(pos & 0xFFFFFFFFULL);
                edim_buf->rd_words[1] = (uint32_t)((pos >> 32) & 0xFFFFFFFFULL);
                break;
            }
            case EDIM_PROTO_BISS:
                for (uint32_t i = 0U; i < edim_buf->sl_nums; i++) {
                    uint64_t data = edim_biss_data_read(i);
                    edim_buf->rd_words[2U * i] = (uint32_t)(data & 0xFFFFFFFFU);
                    edim_buf->rd_words[2U * i + 1U] = (uint32_t)((data >> 32U) & 0xFFFFFFFFU);
                }
                break;
            case EDIM_PROTO_ENDAT:
                edim_buf->rd_words[0] = EDIM_ENDAT_RDATA0;
                edim_buf->rd_words[1] = EDIM_ENDAT_RDATA1;
                edim_buf->rd_words[2] = EDIM_ENDAT_RDATA2;
                edim_buf->rd_words[3] = EDIM_ENDAT_RDATA3;
                break;
            case EDIM_PROTO_AFMT:
                for (uint32_t i = 0U; i < edim_buf->sl_nums; i++) {
                    for (uint32_t j = 0U; j < 3U; j++) {
                        edim_buf->rd_words[3U * i + j] = edim_afmt_data_read((edim_afmt_slave_enum)i, (edim_afmt_rdata_enum)j);
                    }
                }
                break;
            case EDIM_PROTO_TFMT:
                for (uint32_t j = 0U; j < 4U; j++) {
                    edim_buf->rd_words[j] = edim_tfmt_data_read((edim_tfmt_rdata_enum)j);
                }
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      set EDIM baud rate (API_ID(0x0007U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[in]  baud_rate: baud rate to be set
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_baud_set(edim_proto_enum edim_proto, edim_channel_enum edim_ch, uint32_t baud_rate)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    }
    struct baud_item { uint32_t rate; uint32_t regval; };
    const struct baud_item *table = NULL;
    uint32_t table_sz = 0U;
    uint32_t reg_mask = 0U;
    volatile uint32_t *reg_addr = NULL;
    uint32_t add_tmp = 0U;

