RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim.c
    if (error == EDIM_ERROR_NONE) {
        if (baud_rate == 0U) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT: {
                static const struct baud_item afmt_tbl[] = {
                    { 2500000UL, EDIM_AFMT_BAUD_2_5MBPS },
                    { 4000000UL, EDIM_AFMT_BAUD_4MBPS },
                    { 6667000UL, EDIM_AFMT_BAUD_6_67MBPS },
                    { 8000000UL, EDIM_AFMT_BAUD_8MBPS },
                    {16000000UL, EDIM_AFMT_BAUD_16MBPS },
                };
                table = afmt_tbl;
                table_sz = sizeof(afmt_tbl) / sizeof(afmt_tbl[0]);
                reg_mask = EDIM_AFMT_CFG_BAUD;
                reg_addr = &EDIM_AFMT_CFG;
                break;
            }
            case EDIM_PROTO_ENDAT: {
                static const struct baud_item endat_tbl[] = {
                    {16670000UL, EDIM_ENDAT_TCLK_16_67MHz},
                    { 8330000UL, EDIM_ENDAT_TCLK_8_33MHz },
                    { 4160000UL, EDIM_ENDAT_TCLK_4_16MHz },
                    { 2000000UL, EDIM_ENDAT_TCLK_2MHz    },
                    { 1000000UL, EDIM_ENDAT_TCLK_1MHz    },
                    { 200000UL,  EDIM_ENDAT_TCLK_200KHz  },
                    { 100000UL,  EDIM_ENDAT_TCLK_100KHz  },
                };
                table = endat_tbl;
                table_sz = sizeof(endat_tbl) / sizeof(endat_tbl[0]);
                reg_mask = EDIM_ENDAT_CFG0_TCLK;
                reg_addr = &EDIM_ENDAT_CFG0;
                break;
            }
            case EDIM_PROTO_BISS: {
                uint32_t pclk1 = rcu_clock_freq_get(CK_APB1);
                uint64_t ratio_times2 = ((uint64_t)pclk1 * 2ULL) / (uint64_t)baud_rate;
                uint32_t ratio = (uint32_t)((ratio_times2 + 1ULL) / 2ULL);
                uint32_t prescaler = (ratio > 0U) ? (ratio - 1U) : 0U;
                if (prescaler < 7U) {
                    prescaler = 7U;
                }
                if (prescaler > 32767U) {
                    prescaler = 32767U;
                }
                edim_biss_ma_prescaler_config(prescaler);
                break;
            }
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }

    if ((error == EDIM_ERROR_NONE) && (table != NULL)) {
        int matched = 0;
        for (uint32_t i = 0U; i < table_sz; i++) {
            add_tmp = (uint32_t)table + i * 8U;
            if ((*(struct baud_item *)add_tmp).rate == baud_rate) {
                uint32_t regv = *reg_addr;
                regv &= ~reg_mask;
                regv |= (*(struct baud_item *)add_tmp).regval;
                *reg_addr = regv;
                matched = 1;
                break;
            }
        }
        if (!matched) {
            error = EDIM_ERROR_INVAL_BAUD;
        }
    }
    return error;
}

/*!
    \brief      access edim register operation (API_ID(0x0008U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[in]  config: control configuration structure
    \param[in]  timeout_cycles: control timeout time 
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_reg_access_operation(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_reg_access_config_struct *config, uint32_t timeout_cycles)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(config)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (config == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else if (config->sl_index >= EDIM_SLAVES_MAX ) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_BISS: {
                if ((config->size == 0U) || (config->size > 64U)) {
                    error = EDIM_ERROR_INVAL_PARA;
                    break;
                }
                edim_biss_control_comm_struct reg_access_cmd;
                reg_access_cmd.reg_addr   = config->memaddr;
                reg_access_cmd.reg_n_byte = config->size;
                reg_access_cmd.reg_r_w    = config->reg_rw;
                reg_access_cmd.slave_id   = config->sl_index;
                for (uint32_t i = 0U; i < reg_access_cmd.reg_n_byte; i++) {
                    reg_access_cmd.r_w_data[i] = (uint8_t)config->data[i];
                }
                edim_biss_reg_access(&reg_access_cmd);
                edim_biss_send_frame(EDIM_BISS_SEND_AUTO_CTRL_FRAME);
                error = edim_wait_flag_set(&EDIM_BISS_STAT0, EDIM_BISS_STAT0_EOCC, timeout_cycles);
                break;
            }
            case EDIM_PROTO_ENDAT: {
                edim_endat_command(EDIM_ENDAT_MODE_SELECT_MEM_AREA, (uint32_t)config->memaddr, 0U);
                edim_software_trigger(edim_proto, edim_ch);
                error = edim_wait_flag_set(&EDIM_ENDAT_STAT, EDIM_ENDAT_STAT_NEXTRDYF, timeout_cycles);
                if (error != EDIM_ERROR_NONE) {
                    break;
                }
                if (config->reg_rw == EDIM_WRITE) {
                    edim_endat_command(EDIM_ENDAT_MODE_RECEIVE_PARA, (uint32_t)config->data[0U], (uint32_t)config->data[1U]);
                } else {
                    edim_endat_command(EDIM_ENDAT_MODE_SEND_PARA, (uint32_t)config->data[0U], 0U);
                }
                edim_software_trigger(edim_proto, edim_ch);
                error = edim_wait_flag_set(&EDIM_ENDAT_STAT, EDIM_ENDAT_STAT_NEXTRDYF, timeout_cycles);
                break;
            }
            case EDIM_PROTO_AFMT: {
                if (config->reg_rw == EDIM_WRITE) {
                    edim_afmt_command_with_eeprom_write((uint8_t)config->sl_index, (uint8_t)config->memaddr, (uint16_t)config->data[0]);
                } else {
                    edim_afmt_command_with_eeprom_read((uint8_t)config->sl_index, (uint8_t)config->memaddr);
                }
                edim_software_trigger(edim_proto, edim_ch);
                error = edim_wait_flag_set(&EDIM_AFMT_STAT, EDIM_AFMT_FLAG_EOC, timeout_cycles);
                break;
            }
            case EDIM_PROTO_TFMT: {
                if (config->reg_rw == EDIM_WRITE) {
                    edim_tfmt_command_with_eeprom_write((uint8_t)config->memaddr, (uint8_t)config->data[0]);
                } else {
                    edim_tfmt_command_with_eeprom_read((uint8_t)config->memaddr);
                }
                edim_software_trigger(edim_proto, edim_ch);
                error = edim_wait_flag_set(&EDIM_TFMT_STAT, EDIM_TFMT_FLAG_EOC, timeout_cycles);
                break;
            }
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      edim full position acquisition operation (API_ID(0x0009U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[in]  config: control configuration structure
    \param[in]  timeout_cycles: control timeout time
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_full_pos_acquisition_operation(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_process_data_config_struct *config, uint32_t timeout_cycles)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(config)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_BISS:
                edim_biss_send_frame(EDIM_BISS_SEND_SINGLE_DATA_FRAME_WITH_CDM_0);
                error = edim_wait_flag_set(&EDIM_BISS_STAT0, EDIM_BISS_STAT0_EODT, timeout_cycles);
                break;
            case EDIM_PROTO_ENDAT:
                edim_endat_command(EDIM_ENDAT_MODE_GET_POS, 0U, 0U);
                edim_software_trigger(edim_proto, edim_ch);
                error = edim_wait_flag_set(&EDIM_ENDAT_STAT, EDIM_ENDAT_STAT_NEXTRDYF, timeout_cycles);
                break;
            case EDIM_PROTO_AFMT: {
                if ((config == NULL) || (config->sl_index >= EDIM_SLAVES_MAX)) {
                    error = EDIM_ERROR_INVAL_PARA;
                } else {
                    uint32_t cmd = (config->commu_mode == EDIM_COMM_MODE_GLOBAL) ? EDIM_AFMT_CMD_CC_BRDABS40 : EDIM_AFMT_CMD_CC_INDABS40;
                    edim_afmt_command((uint8_t)config->sl_index, (uint8_t)cmd);
                    edim_software_trigger(edim_proto, edim_ch);
                    error = edim_wait_flag_set(&EDIM_AFMT_STAT, EDIM_AFMT_FLAG_EOC, timeout_cycles);
                }
                break;
            }
            case EDIM_PROTO_TFMT:
                edim_tfmt_command(EDIM_TFMT_DATAID_CC_RDALL);
                edim_software_trigger(edim_proto, edim_ch);
                error = edim_wait_flag_set(&EDIM_TFMT_STAT, EDIM_TFMT_FLAG_EOC, timeout_cycles);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      edim control encoder operations (API_ID(0x000AU))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[in]  config: control configuration structure
    \param[in]  timeout_cycles: control timeout time 
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_control_encoder_operation(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_control_config_struct *config, uint32_t timeout_cycles)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(config)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (config == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_BISS: {
                static const uint32_t biss_cmd_arr[4] = { EDIM_BISS_CMD_CHECKIDA(0), EDIM_BISS_CMD_CHECKIDA(1), EDIM_BISS_CMD_ALWAYSEXE(0), EDIM_BISS_CMD_ALWAYSEXE(1) };
                if ((config->op > EDIM_CONTROL_ALL_SLAVE_COMMUNICATION_CONTROL_ACTIVE) ||
                    (config->op < EDIM_CONTROL_PROCESS_DATA_ACTIVE) ||
                    ((uint32_t)config->sl_index > (uint32_t)EDIM_CONTROL_ALL_SLAVE_COMMUNICATION_CONTROL_ACTIVE)) {
                    error = EDIM_ERROR_INVAL_PARA;
                } else {
                    edim_biss_command((uint32_t)config->sl_index, biss_cmd_arr[((uint32_t)config->op - (uint32_t)EDIM_CONTROL_PROCESS_DATA_ACTIVE)]);
                    edim_biss_send_frame(EDIM_BISS_SEND_AUTO_CTRL_FRAME);
                }
                if (error == EDIM_ERROR_NONE) {
                    error = edim_wait_flag_set(&EDIM_BISS_STAT0, EDIM_BISS_STAT0_EOCC, timeout_cycles);
                }
                break;
            }
            case EDIM_PROTO_ENDAT:
                if (config->op != EDIM_CONTROL_RESET_STATUS) {
                    error = EDIM_ERROR_INVAL_PARA;
                } else {
                    edim_endat_command(EDIM_ENDAT_MODE_RECEIVE_RESET, 0U, 0U);
                    edim_endat_data_transmission_software_trigger();
                    error = edim_wait_flag_set(&EDIM_ENDAT_STAT, EDIM_ENDAT_STAT_NEXTRDYF, timeout_cycles);
                }
                break;
            case EDIM_PROTO_AFMT: {
                static const uint32_t afmt_cmd_arr[3] = {EDIM_AFMT_CMD_CC_INDSTACLR, EDIM_AFMT_CMD_CC_ABSRST, EDIM_AFMT_CMD_CC_MUTCLR};
                if ((config->op > EDIM_CONTROL_SET_SLAVE_ADDRESS) || (config->sl_index > EDIM_SLAVES_MAX)) {
                    error = EDIM_ERROR_INVAL_PARA;
                    break;
                }
                if (config->op == EDIM_CONTROL_SET_SLAVE_ADDRESS) {
                    edim_afmt_command((uint8_t)config->sl_index, (uint8_t)EDIM_AFMT_CMD_CC_ADDSETII);
                    edim_software_trigger(edim_proto, edim_ch);
                    error = edim_wait_flag_set(&EDIM_AFMT_STAT, EDIM_AFMT_FLAG_EOC, timeout_cycles);
                } else {
                    for (uint32_t j = 0U; j < EDIM_AFMT_RESET_OP_CNT; j++) {
                        edim_afmt_command((uint8_t)config->sl_index, (uint8_t)afmt_cmd_arr[config->op]);
                        edim_software_trigger(edim_proto, edim_ch);
                        error = edim_wait_flag_set(&EDIM_AFMT_STAT, EDIM_AFMT_FLAG_EOC, timeout_cycles);
                        if (error != EDIM_ERROR_NONE) {
                            break;
                        }
                    }
                }
                break;
            }
            case EDIM_PROTO_TFMT: {
                static const uint32_t tfmt_cmd_arr[3] = { EDIM_TFMT_DATAID_CC_RSTERR, EDIM_TFMT_DATAID_CC_RSTPOS, EDIM_TFMT_DATAID_CC_RSTTURNSERR };
                if (config->op > EDIM_CONTROL_RESET_MULTIPLE_POS) {
                    error = EDIM_ERROR_INVAL_PARA;
                    break;
                }
                for (uint32_t j = 0U; j < EDIM_TFMT_RESET_OP_CNT; j++) {
                    edim_tfmt_flag_clear(EDIM_TFMT_FLAG_EOC);
                    edim_tfmt_command(tfmt_cmd_arr[config->op]);
                    edim_software_trigger(edim_proto, edim_ch);
                    error = edim_wait_flag_set(&EDIM_TFMT_STAT, EDIM_TFMT_FLAG_EOC, timeout_cycles);
                    if (error != EDIM_ERROR_NONE) {
                        break;
                    }
                }
                break;
            }
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      edim software trigger (API_ID(0x000BU))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_software_trigger(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_ENDAT:
            edim_endat_data_transmission_software_trigger();
            break;
        case EDIM_PROTO_AFMT:
            edim_afmt_software_trigger();
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_software_trigger();
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      edim hardware trigger (API_ID(0x000CU))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE if successful, error code otherwise
*/
edim_error_enum edim_select_ext_trigger(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_BISS:
            edim_biss_auto_transmission_config(EDIM_BISS_AUTO_DATA_TRANSMIT_EXT_TRIGGER);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_internal_timer_trigger_period_config(EDIM_ENDAT_PERIOD_DISABLE);
            edim_endat_hardware_trigger_config(ENABLE);
            break;
        case EDIM_PROTO_AFMT:
            edim_afmt_trigger_mode_config(EDIM_AFMT_TRIGGER_TRIGSEL);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_trigger_mode_config(EDIM_TFMT_TRIGGER_TRIGSEL);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      enable frame-end interrupt for a protocol (API_ID(0x000DU))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0, EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported
 */
edim_error_enum edim_frame_end_interrupt_enable(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_interrupt_enable(EDIM_AFMT_INT_EOC);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_interrupt_enable(EDIM_TFMT_INT_EOC);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_interrupt_enable(EDIM_ENDAT_INT_DATACHK);
            break;
        case EDIM_PROTO_BISS:
            edim_biss_interrupt_enable(EDIM_BISS_INT_EODTIE);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      disable frame-end interrupt for a protocol (API_ID(0x000EU))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported
*/
edim_error_enum edim_frame_end_interrupt_disable(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_interrupt_disable(EDIM_AFMT_INT_EOC);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_interrupt_disable(EDIM_TFMT_INT_EOC);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_interrupt_disable(EDIM_ENDAT_INT_DATACHK);
            break;
        case EDIM_PROTO_BISS:
            edim_biss_interrupt_disable(EDIM_BISS_INT_EODTIE);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      get frame-end interrupt flag state (API_ID(0x000FU))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[out]  status output flag status (SET if active)
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported
 */
edim_error_enum edim_frame_end_interrupt_flag_get(edim_proto_enum edim_proto, edim_channel_enum edim_ch, FlagStatus *status)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(status)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (status == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                *status = edim_afmt_interrupt_flag_get(EDIM_AFMT_INT_FLAG_EOC);
                break;
            case EDIM_PROTO_TFMT:
                *status = edim_tfmt_interrupt_flag_get(EDIM_TFMT_INT_FLAG_EOC);
                break;
            case EDIM_PROTO_ENDAT:
                *status = edim_endat_interrupt_flag_get(EDIM_ENDAT_INT_FLAG_DATACHK);
                break;
            case EDIM_PROTO_BISS:
                *status = edim_biss_interrupt_flag_get(EDIM_BISS_INT_FLAG_EODT);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

