RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim.c
/*!
    \brief      clear frame-end interrupt flag (API_ID(0x0010U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0, EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported 
*/
edim_error_enum edim_frame_end_interrupt_flag_clear(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_interrupt_flag_clear(EDIM_AFMT_INT_FLAG_EOC);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_interrupt_flag_clear(EDIM_TFMT_INT_FLAG_EOC);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_interrupt_flag_clear(EDIM_ENDAT_INT_FLAG_DATACHK);
            break;
        case EDIM_PROTO_BISS:
            edim_biss_interrupt_flag_clear(EDIM_BISS_INT_FLAG_EODT);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      get raw frame-end status flag (independent of interrupt enable) (API_ID(0x0011U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0, EDIM channel 0  
    \param[out] status output flag status (SET if active)
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported
 */
edim_error_enum edim_frame_end_flag_get(edim_proto_enum edim_proto, edim_channel_enum edim_ch, FlagStatus *status)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(status)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (status == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                *status = edim_afmt_flag_get(EDIM_AFMT_FLAG_EOC);
                break;
            case EDIM_PROTO_TFMT:
                *status = edim_tfmt_flag_get(EDIM_TFMT_FLAG_EOC);
                break;
            case EDIM_PROTO_ENDAT:
                *status = edim_endat_flag_get(EDIM_ENDAT_FLAG_DATACHK);
                break;
            case EDIM_PROTO_BISS:
                *status = edim_biss_flag_get(EDIM_BISS_FLAG_EODT);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      clear raw frame-end status flag (API_ID(0x0012U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_BISS: EDIM select BISS
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported 
*/
edim_error_enum edim_frame_end_flag_clear(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_flag_clear(EDIM_AFMT_FLAG_EOC);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_flag_clear(EDIM_TFMT_FLAG_EOC);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_flag_clear(EDIM_ENDAT_FLAG_DATACHK);
            break;
        case EDIM_PROTO_BISS:
            edim_biss_flag_clear(EDIM_BISS_FLAG_EODT);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      enable timeout interrupt for a protocol (API_ID(0x0013U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported 
 */
edim_error_enum edim_timeout_interrupt_enable(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_interrupt_enable(EDIM_AFMT_INT_TOERR);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_interrupt_enable(EDIM_TFMT_INT_TOERR);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_interrupt_enable(EDIM_ENDAT_INT_TO);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      disable timeout interrupt for a protocol (API_ID(0x0014U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported 
 */
edim_error_enum edim_timeout_interrupt_disable(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_interrupt_disable(EDIM_AFMT_INT_TOERR);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_interrupt_disable(EDIM_TFMT_INT_TOERR);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_interrupt_disable(EDIM_ENDAT_INT_TO);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      get timeout interrupt flag state (API_ID(0x0015U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[out] status: output flag status (SET if active)
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported
 */
edim_error_enum edim_timeout_interrupt_flag_get(edim_proto_enum edim_proto, edim_channel_enum edim_ch, FlagStatus *status)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(status)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x0015U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (status == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                *status = edim_afmt_interrupt_flag_get(EDIM_AFMT_INT_FLAG_TOERR);
                break;
            case EDIM_PROTO_TFMT:
                *status = edim_tfmt_interrupt_flag_get(EDIM_TFMT_INT_FLAG_TOERR);
                break;
            case EDIM_PROTO_ENDAT:
                *status = edim_endat_interrupt_flag_get(EDIM_ENDAT_INT_FLAG_TO);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      clear timeout interrupt flag (API_ID(0x0016U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported 
 */
edim_error_enum edim_timeout_interrupt_flag_clear(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_interrupt_flag_clear(EDIM_AFMT_INT_FLAG_TOERR);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_interrupt_flag_clear(EDIM_TFMT_INT_FLAG_TOERR);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_interrupt_flag_clear(EDIM_ENDAT_INT_FLAG_TO);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      get raw timeout status flag (independent of interrupt enable) (API_ID(0x0017U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[out] status output flag status (SET if active)
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported
 */
edim_error_enum edim_timeout_flag_get(edim_proto_enum edim_proto, edim_channel_enum edim_ch, FlagStatus *status)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(status)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x0017U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (status == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                *status = edim_afmt_flag_get(EDIM_AFMT_FLAG_TOERR);
                break;
            case EDIM_PROTO_TFMT:
                *status = edim_tfmt_flag_get(EDIM_TFMT_FLAG_TOERR);
                break;
            case EDIM_PROTO_ENDAT:
                *status = edim_endat_flag_get(EDIM_ENDAT_FLAG_TO);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      clear raw timeout status flag (API_ID(0x0018U))
    \param[in]  edim_proto: EDIM protocol
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0
    \param[out] none
    \retval     EDIM_ERROR_NONE on success, EDIM_ERROR_INVAL_PROTO if unsupported
*/
edim_error_enum edim_timeout_flag_clear(edim_proto_enum edim_proto, edim_channel_enum edim_ch)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            edim_afmt_flag_clear(EDIM_AFMT_FLAG_TOERR);
            break;
        case EDIM_PROTO_TFMT:
            edim_tfmt_flag_clear(EDIM_TFMT_FLAG_TOERR);
            break;
        case EDIM_PROTO_ENDAT:
            edim_endat_flag_clear(EDIM_ENDAT_FLAG_TO);
            break;
        default:
            error = EDIM_ERROR_INVAL_PROTO;
            break;
        }
    }
    return error;
}

/*!
    \brief      validate DMA error type index
    \param[in]  t: DMA error type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_DMAERR_TIMEOUT: DMA request timeout error
      \arg        EDIM_DMAERR_OVERRUN: DMA FIFO overrun error
      \arg        EDIM_DMAERR_UNDERRUN: DMA FIFO underrun error
    \param[out] none
    \retval     non-zero if valid, 0 if invalid
*/
static int edim_dma_err_index_valid(edim_dma_error_type_enum t)
{
    return ((t == EDIM_DMAERR_TIMEOUT) || (t == EDIM_DMAERR_OVERRUN) || (t == EDIM_DMAERR_UNDERRUN));
}

/*!
    \brief      get DMA error mapping entry pointer
    \param[in]  edim_proto: EDIM protocol selector
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_BISS: EDIM select BISS
    \param[in]  t: DMA error type (see edim_dma_err_index_valid)
    \param[out] none
    \retval     pointer to mapping entry if valid, NULL if edim_proto or type invalid
*/
static const edim_dma_err_map_struct *edim_dma_err_map_get(edim_proto_enum edim_proto, edim_dma_error_type_enum t)
{
    const edim_dma_err_map_struct *p = NULL;
    if (edim_dma_err_index_valid(t)) {
        switch (edim_proto) {
        case EDIM_PROTO_AFMT:
            p = &edim_dma_err_map_afmt[t];
            break;
        case EDIM_PROTO_TFMT:
            p = &edim_dma_err_map_tfmt[t];
            break;
        case EDIM_PROTO_ENDAT:
            p = &edim_dma_err_map_endat[t];
            break;
        case EDIM_PROTO_BISS:
            p = &edim_dma_err_map_biss[t];
            break;
        default:
            break;
        }
    }
    return p;
}

/*!
    \brief      enable DMA error interrupt (timeout / overrun / underrun) for a protocol (API_ID(0x0019U))
    \param[in]  edim_proto: protocol selector
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_BISS: EDIM select BISS
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[in]  err_type: DMA error type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_DMAERR_TIMEOUT: DMA request timeout error
      \arg        EDIM_DMAERR_OVERRUN: FIFO overrun error
      \arg        EDIM_DMAERR_UNDERRUN: FIFO underrun error
    \param[out] none
    \retval     EDIM_ERROR_NONE: on success
                EDIM_ERROR_INVAL_PARA: if err_type unsupported for edim_proto
                EDIM_ERROR_INVAL_PROTO: if edim_proto invalid
*/
edim_error_enum edim_dma_error_interrupt_enable(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_dma_error_type_enum err_type)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        const edim_dma_err_map_struct *m = edim_dma_err_map_get(edim_proto, err_type);
        if (m == NULL) {
            error = (edim_proto >= EDIM_PROTO_MAX) ? EDIM_ERROR_INVAL_PROTO : EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                edim_afmt_interrupt_enable(m->int_enable_bit);
                break;
            case EDIM_PROTO_TFMT:
                edim_tfmt_interrupt_enable(m->int_enable_bit);
                break;
            case EDIM_PROTO_ENDAT:
                edim_endat_interrupt_enable(m->int_enable_bit);
                break;
            case EDIM_PROTO_BISS:
                edim_biss_interrupt_enable(m->int_enable_bit);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      disable DMA error interrupt (timeout / overrun / underrun) for a protocol (API_ID(0x001AU))
    \param[in]  edim_proto: protocol selector
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_BISS: EDIM select BISS
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[in]  err_type: DMA error type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_DMAERR_TIMEOUT: DMA request timeout error
      \arg        EDIM_DMAERR_OVERRUN: FIFO overrun error
      \arg        EDIM_DMAERR_UNDERRUN: FIFO underrun error
    \param[out] none
    \retval     EDIM_ERROR_NONE: on success
                EDIM_ERROR_INVAL_PARA: if err_type unsupported for edim_proto
                EDIM_ERROR_INVAL_PROTO: if edim_proto invalid
*/
edim_error_enum edim_dma_error_interrupt_disable(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_dma_error_type_enum err_type)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        const edim_dma_err_map_struct *m = edim_dma_err_map_get(edim_proto, err_type);
        if (m == NULL) {
            error = (edim_proto >= EDIM_PROTO_MAX) ? EDIM_ERROR_INVAL_PROTO : EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                edim_afmt_interrupt_disable(m->int_enable_bit);
                break;
            case EDIM_PROTO_TFMT:
                edim_tfmt_interrupt_disable(m->int_enable_bit);
                break;
            case EDIM_PROTO_ENDAT:
                edim_endat_interrupt_disable(m->int_enable_bit);
                break;
            case EDIM_PROTO_BISS:
                edim_biss_interrupt_disable(m->int_enable_bit);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      get DMA error interrupt flag (timeout / overrun / underrun) for a protocol (API_ID(0x001BU))
    \param[in]  edim_proto: protocol selector
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_BISS: EDIM select BISS
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[in]  err_type: DMA error type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_DMAERR_TIMEOUT: DMA request timeout error
      \arg        EDIM_DMAERR_OVERRUN: FIFO overrun error
      \arg        EDIM_DMAERR_UNDERRUN: FIFO underrun error
    \param[out] status: SET if active, RESET otherwise
    \retval     EDIM_ERROR_NONE: on success
                EDIM_ERROR_INVAL_PARA: if err_type unsupported for edim_proto
                EDIM_ERROR_INVAL_PROTO: if edim_proto invalid
*/
edim_error_enum edim_dma_error_interrupt_flag_get(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_dma_error_type_enum err_type, FlagStatus *status)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(status)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        const edim_dma_err_map_struct *m = NULL;
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (status == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            m = edim_dma_err_map_get(edim_proto, err_type);
            if (m == NULL) {
                error = (edim_proto >= EDIM_PROTO_MAX) ? EDIM_ERROR_INVAL_PROTO : EDIM_ERROR_INVAL_PARA;
            } else {
                switch (edim_proto) {
                case EDIM_PROTO_AFMT:
                    *status = edim_afmt_interrupt_flag_get((edim_afmt_interrupt_flag_enum)m->int_flag_bit);
                    break;
                case EDIM_PROTO_TFMT:
                    *status = edim_tfmt_interrupt_flag_get((edim_tfmt_interrupt_flag_enum)m->int_flag_bit);
                    break;
                case EDIM_PROTO_ENDAT:
                    *status = edim_endat_interrupt_flag_get((edim_endat_interrupt_flag_enum)m->int_flag_bit);
                    break;
                case EDIM_PROTO_BISS:
                    *status = edim_biss_interrupt_flag_get((edim_biss_interrupt_flag_enum)m->int_flag_bit);
                    break;
                default:
                    error = EDIM_ERROR_INVAL_PROTO;
                    break;
                }
            }
        }
    }
    return error;
}

