RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim.c
/*!
    \brief      clear DMA error interrupt flag (timeout / overrun / underrun) for a protocol (API_ID(0x001CU))
    \param[in]  edim_proto: protocol selector
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_BISS: EDIM select BISS
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[in]  err_type: DMA error type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_DMAERR_TIMEOUT: DMA request timeout error
      \arg        EDIM_DMAERR_OVERRUN: FIFO overrun error
      \arg        EDIM_DMAERR_UNDERRUN: FIFO underrun error
    \param[out] none
    \retval     EDIM_ERROR_NONE: on success
                EDIM_ERROR_INVAL_PARA: if err_type unsupported for edim_proto
                EDIM_ERROR_INVAL_PROTO: if edim_proto invalid
*/
edim_error_enum edim_dma_error_interrupt_flag_clear(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_dma_error_type_enum err_type)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        const edim_dma_err_map_struct *m = edim_dma_err_map_get(edim_proto, err_type);
        if (m == NULL) {
            error = (edim_proto >= EDIM_PROTO_MAX) ? EDIM_ERROR_INVAL_PROTO : EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                edim_afmt_interrupt_flag_clear((edim_afmt_interrupt_flag_enum)m->int_flag_bit);
                break;
            case EDIM_PROTO_TFMT:
                edim_tfmt_interrupt_flag_clear((edim_tfmt_interrupt_flag_enum)m->int_flag_bit);
                break;
            case EDIM_PROTO_ENDAT:
                edim_endat_interrupt_flag_clear((edim_endat_interrupt_flag_enum)m->int_flag_bit);
                break;
            case EDIM_PROTO_BISS:
                edim_biss_interrupt_flag_clear((edim_biss_interrupt_flag_enum)m->int_flag_bit);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}

/*!
    \brief      get raw DMA error status (timeout / overrun / underrun) independent of interrupt enable (API_ID(0x001DU))
    \param[in]  edim_proto: protocol selector
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_BISS: EDIM select BISS
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0  
    \param[in]  err_type: DMA error type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_DMAERR_TIMEOUT: DMA request timeout error
      \arg        EDIM_DMAERR_OVERRUN: FIFO overrun error
      \arg        EDIM_DMAERR_UNDERRUN: FIFO underrun error
    \param[out] status: SET if active, RESET otherwise
    \retval     EDIM_ERROR_NONE: on success
                EDIM_ERROR_INVAL_PARA: if err_type unsupported for edim_proto
                EDIM_ERROR_INVAL_PROTO: if edim_proto invalid
*/
edim_error_enum edim_dma_error_flag_get(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_dma_error_type_enum err_type, FlagStatus *status)
{
    edim_error_enum error = EDIM_ERROR_NONE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(status)) {
        fw_debug_report_err(EDIM_MODULE_ID, API_ID(0x001DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        const edim_dma_err_map_struct *m = NULL;
        if (edim_ch >= EDIM_CHANNEL_MAX) {
            error = EDIM_ERROR_INVAL_CHANNEL;
        } else if (status == NULL) {
            error = EDIM_ERROR_INVAL_PARA;
        } else {
            m = edim_dma_err_map_get(edim_proto, err_type);
            if (m == NULL) {
                error = (edim_proto >= EDIM_PROTO_MAX) ? EDIM_ERROR_INVAL_PROTO : EDIM_ERROR_INVAL_PARA;
            } else {
                switch (edim_proto) {
                case EDIM_PROTO_AFMT:
                    *status = edim_afmt_flag_get(m->status_flag_bit);
                    break;
                case EDIM_PROTO_TFMT:
                    *status = edim_tfmt_flag_get(m->status_flag_bit);
                    break;
                case EDIM_PROTO_ENDAT:
                    *status = edim_endat_flag_get(m->status_flag_bit);
                    break;
                case EDIM_PROTO_BISS:
                    *status = edim_biss_flag_get((edim_biss_flag_enum)m->status_flag_bit);
                    break;
                default:
                    error = EDIM_ERROR_INVAL_PROTO;
                    break;
                }
            }
        }
    }
    return error;
}

/*!
    \brief      clear raw DMA error status flag (timeout / overrun / underrun) for a protocol (API_ID(0x001EU))
    \param[in]  edim_proto: protocol selector
                only one parameter can be selected which is shown as below:
      \arg        EDIM_PROTO_AFMT: EDIM select AFMT
      \arg        EDIM_PROTO_TFMT: EDIM select TFMT
      \arg        EDIM_PROTO_ENDAT: EDIM select ENDAT
      \arg        EDIM_PROTO_BISS: EDIM select BISS
    \param[in]  edim_ch: EDIM channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_CHANNEL_0: EDIM channel 0 
    \param[in]  err_type: DMA error type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_DMAERR_TIMEOUT: DMA request timeout error
      \arg        EDIM_DMAERR_OVERRUN: FIFO overrun error
      \arg        EDIM_DMAERR_UNDERRUN: FIFO underrun error
    \param[out] none
    \retval     EDIM_ERROR_NONE: on success
                EDIM_ERROR_INVAL_PARA: if err_type unsupported for edim_proto
                EDIM_ERROR_INVAL_PROTO: if edim_proto invalid
*/
edim_error_enum edim_dma_error_flag_clear(edim_proto_enum edim_proto, edim_channel_enum edim_ch, edim_dma_error_type_enum err_type)
{
    edim_error_enum error = EDIM_ERROR_NONE;
    if (edim_ch >= EDIM_CHANNEL_MAX) {
        error = EDIM_ERROR_INVAL_CHANNEL;
    } else {
        const edim_dma_err_map_struct *m = edim_dma_err_map_get(edim_proto, err_type);
        if (m == NULL) {
            error = (edim_proto >= EDIM_PROTO_MAX) ? EDIM_ERROR_INVAL_PROTO : EDIM_ERROR_INVAL_PARA;
        } else {
            switch (edim_proto) {
            case EDIM_PROTO_AFMT:
                edim_afmt_flag_clear(m->status_flag_bit);
                break;
            case EDIM_PROTO_TFMT:
                edim_tfmt_flag_clear(m->status_flag_bit);
                break;
            case EDIM_PROTO_ENDAT:
                edim_endat_flag_clear(m->status_flag_bit);
                break;
            case EDIM_PROTO_BISS:
                edim_biss_flag_clear((edim_biss_flag_enum)m->status_flag_bit);
                break;
            default:
                error = EDIM_ERROR_INVAL_PROTO;
                break;
            }
        }
    }
    return error;
}
